DataProcessors/ЗагрузкаКонтактовXLS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКонтактовXLS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тзДанныеИзФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗагрузкаКонтактовXLS/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция УдалитьНачальныеНули(Знач Строка)
	
	Пока Лев(Строка,1) = "0" Цикл
		Строка = Прав(Строка,СтрДлина(Строка)-1)
	КонецЦикла;
	
	Возврат СокрЛП(Строка);
	
КонецФункции

// Чтение данных из файл *.xls в таблицу значений
Процедура ПрочитатьФайл(ИмяФайла, ВидФайла)Экспорт
	
	тзДанныеИзФайла.Очистить();
	
	// создание СОМ-объекта
	Попытка
		
		ОбъектEXCEL = ПолучитьCOMОбъект("","Excel.Application");
		
	Исключение
		
		Сообщить("Невозможно открыть MS EXCEL !!!");
		Возврат;
		
	КонецПопытки;
	
	ОбъектКнига = ОбъектEXCEL.WorkBooks;
	
	// открытие файла
	Попытка
		
		ОткрытаяКнига = ОбъектКнига.Open(СокрЛП(ИмяФайла));
		
	Исключение
		
		Сообщить("Невозможно открыть файл " + СокрЛП(ИмяФайла) + "!");
		Возврат;
		
	КонецПопытки;    
	
	// выбор листа файла
	ЛистКниги 	= ОткрытаяКнига.Sheets();
	Листы 		= Новый СписокЗначений();
	
	Для Счетчик=1 По ОткрытаяКнига.Sheets.Count Цикл
		
		Листы.Добавить(ОткрытаяКнига.Sheets(Счетчик).Name);
		
	КонецЦикла;
	
	ИмяЛиста = Листы.ВыбратьЭлемент("Выберите имя листа EXCEL");
	
	Если ИмяЛиста=Неопределено Тогда
		
		Сообщить("Невозможно найти лист в файле " + СокрЛП(ИмяФайла));
		
		Если Не ЗакрытьEXCEL(ОбъектEXCEL,ОткрытаяКнига) Тогда
			
			Сообщить("Невозможно закрыть файл " + СокрЛП(ИмяФайла) + "!");
			
		КонецЕсли;	
		
		Возврат;
		
	КонецЕсли;
	
	НомерЛиста = Листы.Индекс(ИмяЛиста)+1;
	
	ОткрытаяКнига.Application.Caption = "Открыто из 1С"; 
	
	// открытие листа файла
	Попытка
		
		ЛистКниги = ОткрытаяКнига.Sheets(НомерЛиста);
		ЛистКниги.Select();
		ЛистКниги.Activate();
		
	Исключение
		
		Сообщить("В файле: " + СокрЛП(ИмяФайла) + " нет листа с именем: " + ИмяЛиста);
		
		Если Не ЗакрытьEXCEL(ОбъектEXCEL,ОткрытаяКнига) Тогда
			
			Сообщить("Невозможно закрыть файл " + СокрЛП(ИмяФайла) + "!");
			
		КонецЕсли;
		
		Возврат;
		
	КонецПопытки;
	
	Если ВидФайла = "Контакты" Тогда // чтение контрагентов
		Стр = ПерваяСтрока;
		
		// добавить номера позиций колонок
		ПозТелефон = 1;
		ПозРезультат = 2;
		// ...
		
		Пока НЕ ПустаяСтрока(СокрЛП(ЧитатьЯчейкуEXCEL(ЛистКниги,Стр,ПозТелефон))) Цикл

			// прочитать данные из колонки
			Телефон = СокрЛП(ЧитатьЯчейкуEXCEL(ЛистКниги,Стр,ПозТелефон));
			Результат = СокрЛП(ЧитатьЯчейкуEXCEL(ЛистКниги,Стр,ПозРезультат));
			//...
			
			НоваяСтрока = тзДанныеИзФайла.Добавить();
			НоваяСтрока.Телефон = Телефон;
			НоваяСтрока.Результат = Результат;
			//...
			
			
			Стр = Стр + 1;
			Состояние("Обработка строки № " + Строка(Стр));
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

// Чтение данных из Excel
Функция ЧитатьЯчейкуEXCEL(ЛистКниги,Стр,Столб)
	
	Попытка
		
		Ячейка=ЛистКниги.Cells(Стр,Столб);
		
		Возврат(Формат(Ячейка.Value,"ЧГ="));
		
	Исключение
		
		Сообщить("Системная ошибка: "+ОписаниеОшибки());
		
		Возврат("");
		
	КонецПопытки;

КонецФункции // ЧитатьЯчейкуEXCEL()

// Закрыть приложение Excel
Функция ЗакрытьEXCEL(ОбъектEXCEL,ОткрытаяКнига)
	
	//закрытие Excel
	Попытка
		
		ОткрытаяКнига.Application.Quit();
		ОбъектEXCEL.Quit();
		ОбъектEXCEL.DisplayAlerts = 1;
		ОбъектEXCEL	= Неопределено;
		
	Исключение
		
		Сообщить("Системная ошибка: "+ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ЗакрытьEXCEL()

Функция СтрВДата(Строка)
	Строка = Лев(Строка,10);
	Результат = "";
	Если ПустаяСтрока(Строка) Тогда Возврат Результат КонецЕсли;
	Строка = Строка + ".";
	
	Пока Найти(Строка,".") <> 0 Цикл
		ПозРазделитель = Найти(Строка,".");
		Результат = Лев(Строка,ПозРазделитель - 1) + Результат;
		Строка = Прав(Строка,СтрДлина(Строка) - ПозРазделитель);
	КонецЦикла;
	Возврат Дата(Результат);
КонецФункции

Функция ЧислоСПроверкой(Строка)Экспорт
	Попытка
		Возврат ?(ПустаяСтрока(Строка), 0, Число(Строка));
	Исключение
		Возврат 0;
    КонецПопытки;
КонецФункции

///////////////////////////////////////////////////////////////////////////
// БЛОК ИСПОЛНЕНИЯ
